#pragma once
//-----------------------------------------------------------------------------
//Dialog Lexer
//-----------------------------------------------------------------------------
#include"Lexer.h"
#include"DialogToken.h"



namespace DIALOG
{

	class CLexer :
		// ****************************************************************************
		// Inherited Classes)
		// ----------------------------------------------------------------------------
		public						ILexer
	{
		// ****************************************************************************
		// Constructor/Destructor)
		// ----------------------------------------------------------------------------
	public:
		CLexer(LPCSTR p_strFileName = NULL, DWORD p_dwSizeOfBuffer = MAX_SIZE_OF_BUFFER);
		virtual ~CLexer();


		// ****************************************************************************
		// Public)
		// ----------------------------------------------------------------------------
		// 1) Token을 얻는 함수.
		//    - Return값	Token의 종류를 의미한다.(Definition에 정의된 숫자.)
		//    - String값 	(In/Out)Token에 해당하는 문자열 값을 돌려준다.
		virtual	int				GetToken(LPSTR p_TokenString);
	};


}